Tekla.Structures.DrawingInternal.LayoutManager


Tekla.Structures.DrawingInternal.LayoutManager.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrLayTable_t,Tekla.Structures.DrawingInternal.dotGrString_t,System.Boolean@)


Tekla.Structures.DrawingInternal.LayoutManager.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrLayTable_t,Tekla.Structures.DrawingInternal.dotGrString_t,System.Int32@)


Tekla.Structures.DrawingInternal.LayoutManager.DoesLayoutExist(System.String)


Tekla.Structures.DrawingInternal.LayoutManager.DoesTableLayoutExist(System.String)


Tekla.Structures.DrawingInternal.LayoutManager.InLocalChangesState


Tekla.Structures.DrawingInternal.LayoutManager.DoCommit(System.Boolean)


Tekla.Structures.DrawingInternal.LayoutManager.ClearUndoLog


Tekla.Structures.DrawingInternal.LayoutManager.RefreshUI


Tekla.Structures.DrawingInternal.LayoutManager.SetNameVisibility(System.Boolean)


Tekla.Structures.DrawingInternal.LayoutManager.SetHiddenTableVisibility(System.Boolean)


Tekla.Structures.DrawingInternal.LayoutManager.HiddenTableVisibility


Tekla.Structures.DrawingInternal.LayoutManager.TableNameVisibility


Tekla.Structures.DrawingInternal.LayoutManager.OpenEditor


Tekla.Structures.DrawingInternal.LayoutManager.CloseEditor


Tekla.Structures.DrawingInternal.LayoutManager.ResetDrawingSize(System.Int32)


Tekla.Structures.DrawingInternal.LayoutManager.RepairDrawingSizes


Tekla.Structures.DrawingInternal.LayoutManager.SetDrawingFrames(System.Collections.Generic.IEnumerable{System.Tuple{System.Boolean,System.Double,System.Double,System.Double,System.Double,System.Int32}})


Tekla.Structures.DrawingInternal.LayoutManager.ShowSaveDialog


Tekla.Structures.DrawingInternal.LayoutManager.GetDrawingFrames


Tekla.Structures.DrawingInternal.LayoutManager.SetDrawingFoldmark(System.Tuple{System.Boolean,System.Double,System.Double,System.Int32})


Tekla.Structures.DrawingInternal.LayoutManager.GetDrawingFoldmark


Tekla.Structures.DrawingInternal.LayoutManager.GetDrawingSizes


Tekla.Structures.DrawingInternal.LayoutManager.GetDrawingSizes(System.String)


Tekla.Structures.DrawingInternal.LayoutManager.GetDrawingSize


Tekla.Structures.DrawingInternal.LayoutManager.ModifyDrawingSize(System.Int32,System.Collections.Generic.IEnumerable{System.Tuple{System.Int32,System.String,Tekla.Structures.Drawing.Size,System.Boolean}})


Tekla.Structures.DrawingInternal.LayoutManager.SetDrawingSizes(System.Collections.Generic.IEnumerable{System.Tuple{System.Int32,System.String,Tekla.Structures.Drawing.Size,System.Boolean}},System.Int32)


Tekla.Structures.DrawingInternal.LayoutManager.ZoomToLayout


Tekla.Structures.DrawingInternal.LayoutManager.ResetLayout(System.String,System.Collections.Generic.IEnumerable{System.Tuple{System.Int32,System.String,Tekla.Structures.Drawing.Size,System.Boolean}})


Tekla.Structures.DrawingInternal.LayoutManager.GetAvailableLayouts


Tekla.Structures.DrawingInternal.LayoutManager.CreateLayout(System.String,System.Collections.Generic.IEnumerable{System.Tuple{System.Int32,System.String,Tekla.Structures.Drawing.Size,System.Boolean}})


Tekla.Structures.DrawingInternal.LayoutManager.IsLayoutEditorOpenedFromModelMode


Tekla.Structures.DrawingInternal.LayoutManager.ShouldOpenActiveLayout
